src/config/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квалификация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеПродажНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помощники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помощник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/InformationRegisters/ПраваДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПраваДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНаследованияПравДоступаИерархическихСправочников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаследованияПравДоступаИерархическихСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаборПравПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ВидыНаследованияПравДоступаИерархическихСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНаследованияПравДоступаИерархическихСправочников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаследуетсяОтРодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспространитьНаПодчиненных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоДляТекущегоПрава</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/Пользователи/Ext/ObjectModule.bsl
Перем мПраваДоступаПользователей Экспорт;

// Обработчик события ПриКопировании объекта.
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа
	   И НЕ ОбменДанными.Загрузка
	   И НЕ ЗначениеНеЗаполнено(ОбъектКопирования) Тогда
		ПрочитатьПраваДоступаКОбъекту(мПраваДоступаПользователей, ОбъектКопирования.Ссылка);
	КонецЕсли;

КонецПроцедуры

// Обработчик события ПриЗаписи объекта.
//
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		СписокДляПерезаписиПодчиненных = Новый СписокЗначений;
		
		ЗаписатьПраваДоступаКОбъекту(мПраваДоступаПользователей, Ссылка, Отказ);
		
		Если НЕ Отказ Тогда
			Для каждого Запись Из мПраваДоступаПользователей Цикл
				Если Запись.ВидНаследованияПравДоступаИерархическихСправочников = Перечисления.ВидыНаследованияПравДоступаИерархическихСправочников.РаспространитьНаПодчиненных Тогда
					УстановитьПраваДоступаДляПодчиненныхЭлементов(Запись.ОбъектДоступа, Запись.ОбъектДоступа.Метаданные().Имя, Отказ);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
		
		НаправлениеПродажНаименование = ?(ЗначениеЗаполнено(НаправлениеПродаж),НаправлениеПродаж.Наименование,"");
	КонецЕсли; 

КонецПроцедуры

мПраваДоступаПользователей = РегистрыСведений.ПраваДоступаПользователей.СоздатьНаборЗаписей();
Если НЕ Ссылка.Пустая() Тогда
	ПрочитатьПраваДоступаКОбъекту(мПраваДоступаПользователей, Ссылка);
КонецЕсли;
